Tekla Open API Reference for Tekla Structures 2025
Angle.FromRadians Method
 Creates an angle from a value in radians
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Angle FromRadians(
	double radians
)
Public Shared Function FromRadians (
	radians As Double
) As Angle
Parameters
radians
Type: System.Double
The angle in radians
Return Value
Type: Angle
An Angle object representing the given angle
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace